# Task1.4

## Task description
Встроенная функция input позволяет ожидать и возвращать данные из стандартного
ввода ввиде строк (весь введенный пользователем текст до нажатия им enter).
Используя данную функцию, напишите программу, которая:

1. После запуска предлагает пользователю ввести целые неотрицательные числа,
разделенные любым не цифровым литералом (пробел, запятая, %, буква и т.д.).
2. Получив вводные данные, выделяет полученные числа, суммирует их,
и печатает полученную сумму.

Например:
```
-> 12 12 12
36

-> 123dfgdr%0&45ty-45--900
-777
```

## Report

[File 1.4](Task1.4.py)

```python
inputResult = input("Введите символы (поддерживает отрицательные числа): \n")
numbers = [];
temp = ""
for ch in (inputResult+" "):
    sch = str(ch)
    if (sch in "0123456789"): temp += ch 
    elif (temp != "" and temp != "-"):
        numbers.append(int(temp))
        temp = ""
    else: temp = ""
    if (sch in "-"): temp = "-"
print(sum(numbers)) 
```
