# Task2.2

## Task description

Встроенная функция input позволяет ожидать и возвращать данные из стандартного
ввода в виде строки (весь введенный пользователем текст до нажатия им enter).
Используя данную функцию, напишите программу, которая:

1. После запуска предлагает пользователю ввести текст.
2. Проверяет и, если возможно, преобразовывает полученный текст в число,
используя рекурсивную функцию.
Если число четное - делит его на 2 и выводит результат.
Если число нечетное - умножает на 3 и прибавляет 1.
После чего ждет следующего ввода.
3.При получении в качестве вводных данных 'cancel' завершает свою работу.

Пример:

```
-> Привет123
Не удалось преобразовать введенный текст в число.
-> 2
1
-> 3
10
-> Два
Не удалось преобразовать введенный текст в число.
-> cancel
Bye!
```


## Report

[File 2.2](Task2.2.py)   

```python
def userInput():
    inp = input("Введите число: \n");
    if (inp.lower() == 'cancel'): return "Bye!"
    try: value = int(inp)
    except:
        print("Не удалось преобразовать введенный текст в число.")
        return userInput()
    return int(value / 2) if (value % 2 == 0) else value * 3 + 1
print(userInput())
```
